ｻｿ// 莠後▽縺ｮ謨ｴ謨ｰ蛟､繧定ｪｭ縺ｿ霎ｼ繧薙〒蜉貂帑ｹ鈴勁縺励◆蛟､繧定｡ｨ遉ｺ

#include <iostream>

using namespace std;

int main()
{
	int x;		// 蜉貂帑ｹ鈴勁縺吶ｋ蛟､
	int y;		// 蜉貂帑ｹ鈴勁縺吶ｋ蛟､

	cout << "x縺ｨy繧貞刈貂帑ｹ鈴勁縺励∪縺吶n";

	cout << "x縺ｨy縺ｮ蛟､ｼ";	// x縺ｨy縺ｮ蛟､縺ｮ蜈･蜉帙ｒ菫☆
	cin >> x >> y;			// x縺ｨy縺ｫ謨ｴ謨ｰ蛟､繧定ｪｭ縺ｿ霎ｼ繧

	cout << "x + y縺ｯ" << x + y << "縺ｧ縺吶n";	// x + y縺ｮ蛟､繧定｡ｨ遉ｺ
	cout << "x - y縺ｯ" << x - y << "縺ｧ縺吶n";	// x - y縺ｮ蛟､繧定｡ｨ遉ｺ
	cout << "x * y縺ｯ" << x * y << "縺ｧ縺吶n";	// x * y縺ｮ蛟､繧定｡ｨ遉ｺ
	cout << "x / y縺ｯ" << x / y << "縺ｧ縺吶n";	// x / y縺ｮ蛟､繧定｡ｨ遉ｺｼ亥膚ｼ
	cout << "x % y縺ｯ" << x % y << "縺ｧ縺吶n";	// x % y縺ｮ蛟､繧定｡ｨ遉ｺｼ亥臆菴呻ｼ
}
